STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_ota/STM32_WPAN/App/ota_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    ota_app.c
  * @author  MCD Application Team
  * @brief   ota_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "log_module.h"
#include "app_ble.h"
#include "ll_sys_if.h"
#include "dbg_trace.h"
#include "ota_app.h"
#include "ota.h"
#include "stm32_rtos.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
#include "flash_driver.h"
#include "flash_manager.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum
{
  FILE_TYPE_USER_CONF = 0,
  FILE_TYPE_FW_APP,
} OTA_APP_FileType_t;

/* USER CODE END PTD */

typedef enum
{
  Conf_INDICATION_OFF,
  Conf_INDICATION_ON,
  /* USER CODE BEGIN Service2_APP_SendInformation_t */
  OTA_APP_No_Pending,
  OTA_APP_Pending,
  OTA_APP_Ready_Pending,
  /* USER CODE END Service2_APP_SendInformation_t */
  OTA_APP_SENDINFORMATION_LAST
} OTA_APP_SendInformation_t;

typedef struct
{
  OTA_APP_SendInformation_t     Conf_Indication_Status;
  /* USER CODE BEGIN Service2_APP_Context_t */
  uint32_t base_address;
  uint8_t sectors;
  uint32_t write_value[60];
  uint8_t  write_value_index;
  uint8_t  file_type;
  /* USER CODE END Service2_APP_Context_t */
  uint16_t              ConnectionHandle;
} OTA_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* Define list of reboot reason */
#define REBOOT_ON_FW_APP          (0x00)

/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* Compute start address where the User Configuration shall be located */
#define USER_CFG_SLOT_START_SECTOR_INDEX      (CFG_SNVMA_START_SECTOR_ID - CFG_USER_DATA_SECTORS_NB)

/* Compute size in Page of Download and Active slots */
#define DOWNLOAD_ACTIVE_NB_SECTORS            (CFG_SNVMA_START_SECTOR_ID - CFG_USER_DATA_SECTORS_NB)

/* Compute size in Page of Download or active slot */
#define APP_SLOT_PAGE_SIZE                    ((DOWNLOAD_ACTIVE_NB_SECTORS - CFG_ACTIVE_SLOT_START_SECTOR_INDEX) / 2)

/* Compute start address where the NEW application shall be downloaded */
#define DOWNLOAD_SLOT_START_SECTOR_INDEX      (APP_SLOT_PAGE_SIZE + CFG_ACTIVE_SLOT_START_SECTOR_INDEX)

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static OTA_APP_Context_t OTA_APP_Context;

uint8_t a_OTA_UpdateCharData[247];

/* USER CODE BEGIN PV */
static uint32_t size_left;
static uint32_t address_offset;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void OTA_Conf_SendIndication(void);

/* USER CODE BEGIN PFP */
static void DeleteSlot( uint8_t page_idx );
static void FM_WriteCallback (FM_FlashOp_Status_t Status);
/* Flag for write status  */
static FM_FlashOp_Status_t FM_WriteStatus;
/* Write test callback */
static FM_CallbackNode_t FM_WriteStatusCallback =
{
  /* Header for chained list */
  .NodeList =
  {
    .next = NULL,
    .prev = NULL
  },
  /* Callback for request status */
  .Callback = FM_WriteCallback
};
static void FM_EraseCallback (FM_FlashOp_Status_t Status);
/* Flag for write status  */
static FM_FlashOp_Status_t FM_EraseStatus;
/* Write test callback */
static FM_CallbackNode_t FM_EraseStatusCallback =
{
  /* Header for chained list */
  .NodeList =
  {
    .next = NULL,
    .prev = NULL
  },
  /* Callback for request status */
  .Callback = FM_EraseCallback
};

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void OTA_Notification(OTA_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service2_Notification_1 */
  OTA_Data_t msg_conf;
  /* USER CODE END Service2_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service2_Notification_Service2_EvtOpcode */
    case OTA_CONF_EVT:
      {
      /* The Remote notifies it has send all the data to be written in Flash */

      /* Decide now what to do after all the data has been written in Flash */

        switch(OTA_APP_Context.file_type)
        {
          case FILE_TYPE_FW_APP:
            {
              LOG_INFO_APP("OTA_CONF_EVT: Reboot on new application\n");
              /**
               * Reboot on FW Application
               */
              CFG_OTA_REBOOT_VAL_MSG = REBOOT_ON_FW_APP;

              /**
               * Give the download sector
               */
              CFG_OTA_START_SECTOR_IDX_VAL_MSG = (OTA_APP_Context.base_address - FLASH_BASE) >> 13;

              NVIC_SystemReset(); /* it waits until reset */
            }
            break;

          default:
            break;
        }
      }
      break;

    case OTA_READY_EVT:
      break;
    /* USER CODE END Service2_Notification_Service2_EvtOpcode */

    case OTA_BASE_ADR_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN Service2Char1_WRITE_NO_RESP_EVT */
      {
        switch( ((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Command )
        {
          case OTA_STOP_ALL_UPLOAD:
            break;

