STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_ota/STM32_WPAN/App/ota_app.c
          case OTA_USER_CONF_UPLOAD:
            {
              uint32_t first_valid_address;
              FM_Cmd_Status_t error = FM_ERROR;

              OTA_APP_Context.file_type = FILE_TYPE_USER_CONF;
              ((uint8_t*)&OTA_APP_Context.base_address)[0] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[2];
              ((uint8_t*)&OTA_APP_Context.base_address)[1] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[1];
              ((uint8_t*)&OTA_APP_Context.base_address)[2] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[0];
              OTA_APP_Context.base_address |= FLASH_BASE;
              if(p_Notification->DataTransfered.Length > 4)
              {
                OTA_APP_Context.sectors = ((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Sectors;
              }
              else
              {
                OTA_APP_Context.sectors = 0;
              }
              
              OTA_APP_Context.write_value_index = 0;
              OTA_APP_Context.Conf_Indication_Status = OTA_APP_Ready_Pending;
              first_valid_address = USER_CFG_SLOT_START_SECTOR_INDEX * FLASH_PAGE_SIZE + FLASH_BASE;
              if(((OTA_APP_Context.base_address & 0xF) == 0) &&
                 (OTA_APP_Context.sectors <= CFG_USER_DATA_SECTORS_NB) &&
                 (OTA_APP_Context.base_address >= first_valid_address) &&
                 ((OTA_APP_Context.base_address + ((OTA_APP_Context.sectors) * FLASH_PAGE_SIZE)) <= (first_valid_address + (CFG_USER_DATA_SECTORS_NB * FLASH_PAGE_SIZE))))
              { /* Download address is 128 bits aligned */
                /* Size of file to download fit in user configuration slot */
                /* Download address is in the user configuration area */
                /* End download address fit in the download area */

                /* Clear events before start testing */
                UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

                /* Erase targeted sectors */
                while(error != FM_OK)
                {  
                  /* Flash manager erase */
                  if(OTA_APP_Context.sectors == 0)
                  {
                    OTA_APP_Context.sectors = CFG_USER_DATA_SECTORS_NB;
                  }
                  error = FM_Erase((uint32_t)USER_CFG_SLOT_START_SECTOR_INDEX, 
                                   (uint32_t)(OTA_APP_Context.sectors),
                                   &FM_EraseStatusCallback);

                  /* Check Erase result */
                  if (error == FM_OK)
                  {
                    /* Wait for Erase callback to be invoked */
                    UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

                    /* Clear events before start testing */
                    UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

                    /* Check status of Erase status. */
                    if (FM_EraseStatus != FM_OPERATION_COMPLETE)
                    {
                      error = FM_ERROR;
                      LOG_INFO_APP("OTA_USER_CONF_UPLOAD: FM_EraseStatus != FM_OPERATION_COMPLETE => FM_ERROR\n");
                    }
                  }
                  else if(error == FM_BUSY)
                  {
                    /* Wait for Erase callback to be invoked */
                    UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);
                    
                    /* Clear events before start testing */
                    UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);
                  }
                  else
                  {
                    LOG_INFO_APP("OTA_USER_CONF_UPLOAD: FM_ERROR\n");
                  }
                } /* while(error != FM_OK) */

                /* Flash zone tagetted has been erased, now ready to receive a file to write it */
                a_OTA_UpdateCharData[0] = OTA_READY_TO_RECEIVE_FILE;
                msg_conf.p_Payload = a_OTA_UpdateCharData;
                msg_conf.Length = 1;
                OTA_UpdateValue(OTA_CONF, &msg_conf);
              }
              else
              {
                LOG_INFO_APP("OTA_USER_CONF_UPLOAD: Not ready to receive file, oversized\n");
                LOG_INFO_APP("OTA_USER_CONF_UPLOAD: First 128 bits aligned address to download should be: 0x%08X\n", first_valid_address);
                a_OTA_UpdateCharData[0] = OTA_NOT_READY_TO_RECEIVE_FILE;
                msg_conf.p_Payload = a_OTA_UpdateCharData;
                msg_conf.Length = 1;
                OTA_UpdateValue(OTA_CONF, &msg_conf);
              }
            }
            break;

          case OTA_APPLICATION_UPLOAD:
            {
              uint32_t first_valid_address;
              FM_Cmd_Status_t error = FM_ERROR;
              
              OTA_APP_Context.file_type = FILE_TYPE_FW_APP;
              ((uint8_t*)&OTA_APP_Context.base_address)[0] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[2];
              ((uint8_t*)&OTA_APP_Context.base_address)[1] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[1];
              ((uint8_t*)&OTA_APP_Context.base_address)[2] = (((uint8_t*)((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Base_Addr))[0];
              OTA_APP_Context.base_address |= FLASH_BASE;
              OTA_APP_Context.sectors = 0;
              if(p_Notification->DataTransfered.Length > 4)
              {
                OTA_APP_Context.sectors = ((OTA_Base_Addr_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Sectors;
              }
              else
              {
                OTA_APP_Context.sectors = APP_SLOT_PAGE_SIZE;
              }
              
              OTA_APP_Context.write_value_index = 0;
              OTA_APP_Context.Conf_Indication_Status = OTA_APP_Ready_Pending;
              first_valid_address = ((CFG_ACTIVE_SLOT_START_SECTOR_INDEX + APP_SLOT_PAGE_SIZE) * FLASH_PAGE_SIZE) + FLASH_BASE;
              if(((OTA_APP_Context.base_address & 0xF) == 0) &&
                 (OTA_APP_Context.sectors <= APP_SLOT_PAGE_SIZE) &&
                 (OTA_APP_Context.base_address >= first_valid_address) &&
                 ((OTA_APP_Context.base_address + ((OTA_APP_Context.sectors) * FLASH_PAGE_SIZE)) <= (first_valid_address + (APP_SLOT_PAGE_SIZE * FLASH_PAGE_SIZE))))
              { /* Download address is 128 bits aligned */
                /* Size of file to download fit in download slot */
                /* Download address is in the download area */
                /* End download address fit in the download area */
                /* Erase the sectors */
                /* Clear events before start testing */
                UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

