STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_p2pServer_ota/STM32_WPAN/App/ota_app.c
                while(error != FM_OK)
                {  
                  /* Flash manager Erase */
                  if(OTA_APP_Context.sectors == 0)
                  {
                    OTA_APP_Context.sectors = APP_SLOT_PAGE_SIZE;
                  }
                  error = FM_Erase((uint32_t)((OTA_APP_Context.base_address - FLASH_BASE) >> 13), 
                                   (uint32_t)(OTA_APP_Context.sectors),
                                   &FM_EraseStatusCallback);

                  /* Check Erase result. */
                  if (error == FM_OK)
                  {
                    /* Wait for Erase callback to be invoked */
                    UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

                    /* Clear events before start testing */
                    UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);

                    /* Check status of Erase. */
                    if (FM_EraseStatus != FM_OPERATION_COMPLETE)
                    {
                      error = FM_ERROR;
                      LOG_ERROR_APP("OTA_APPLICATION_UPLOAD: FM_EraseStatus != FM_OPERATION_COMPLETE => FM_ERROR\n");
                    }
                  }
                  else if(error == FM_BUSY)
                  {
                    /* Wait for Erase callback to be invoked */
                    UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);
                    
                    /* Clear events before start testing */
                    UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_ERASE_CALLBACK_EVT_RSP_ID);
                  }
                  else
                  {
                    LOG_ERROR_APP("OTA_APPLICATION_UPLOAD: FM_ERROR\n");
                    LOG_ERROR_APP("OTA_APPLICATION_UPLOAD: Try to FM_Erase Number of sectors: %d from sector %d \n",
                                 (uint32_t)(OTA_APP_Context.sectors),
                                 (uint32_t)((OTA_APP_Context.base_address) >> 13));
                  }
                } /* while(error != FM_OK) */

              /* Flash zone tagetted has been erased, now ready to receive a file to write it */

                a_OTA_UpdateCharData[0] = OTA_READY_TO_RECEIVE_FILE;
                msg_conf.p_Payload = a_OTA_UpdateCharData;
                msg_conf.Length = 1;
                OTA_UpdateValue(OTA_CONF, &msg_conf);
              }
              else
              {
                LOG_WARNING_APP("OTA_APPLICATION_UPLOAD: Not ready to receive file, oversized\n", OTA_APP_Context.base_address, OTA_APP_Context.sectors);
                LOG_WARNING_APP("OTA_APPLICATION_UPLOAD: First 128 bits aligned address to download should be: 0x%x\n", first_valid_address);
                a_OTA_UpdateCharData[0] = OTA_NOT_READY_TO_RECEIVE_FILE;
                msg_conf.p_Payload = a_OTA_UpdateCharData;
                msg_conf.Length = 1;
                OTA_UpdateValue(OTA_CONF, &msg_conf);
              }
            }
            break;

          case OTA_UPLOAD_FINISHED:
            {
              if(OTA_APP_Context.file_type == FILE_TYPE_FW_APP)
              { /* Reboot only after new application download */
                OTA_APP_Context.Conf_Indication_Status = OTA_APP_Pending;
                a_OTA_UpdateCharData[0] = OTA_REBOOT_CONFIRMED;
                msg_conf.p_Payload = a_OTA_UpdateCharData;
                msg_conf.Length = 1;
                OTA_UpdateValue(OTA_CONF, &msg_conf);
              }
            }
            break;

          case OTA_CANCEL_UPLOAD:
          {
            LOG_INFO_APP("OTA_CANCEL_UPLOAD\n");
          }
          break;

          default:
            break;
        }
      }
      /* USER CODE END Service2Char1_WRITE_NO_RESP_EVT */
      break;

    case OTA_CONF_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char2_INDICATE_ENABLED_EVT */
      LOG_INFO_APP("OTA_CONF_INDICATE_ENABLED_EVT\n");
      /* USER CODE END Service2Char2_INDICATE_ENABLED_EVT */
      break;

    case OTA_CONF_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char2_INDICATE_DISABLED_EVT */
      LOG_INFO_APP("OTA_CONF_INDICATE_DISABLED_EVT\n");
      /* USER CODE END Service2Char2_INDICATE_DISABLED_EVT */
      break;

    case OTA_RAW_DATA_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN Service2Char3_WRITE_NO_RESP_EVT */
      {
        FM_Cmd_Status_t error = FM_ERROR;
        
        /**
         * Write in Flash the data received in the BLE packet
         */
        size_left = p_Notification->DataTransfered.Length;
        
        /**
         * For the flash manager the address of the data to be stored in FLASH shall be 32bits aligned
         * and the address where the data shall be written shall be 128bits aligned
         */
        memcpy( (uint8_t*)&OTA_APP_Context.write_value,
                ((OTA_Raw_Data_Event_Format_t*)(p_Notification->DataTransfered.p_Payload))->Raw_Data,
                size_left );

        /* Clear events before start testing */
        UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_WRITE_CALLBACK_EVT_RSP_ID);

        while(error != FM_OK)
        {  
          /* Flash manager Write */
          error = FM_Write ((uint32_t *)(&OTA_APP_Context.write_value[0]),
                            (uint32_t *)((OTA_APP_Context.base_address) + address_offset),
                            size_left >> 2,
                            &FM_WriteStatusCallback);

          /* Check Write result. */
          if (error == FM_OK)
          {
            /* Wait for Write callback to be invoked */
            UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_WRITE_CALLBACK_EVT_RSP_ID);

            /* Clear events before start testing */
            UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_WRITE_CALLBACK_EVT_RSP_ID);

            /* Check status of Write op. */
            if (FM_WriteStatus != FM_OPERATION_COMPLETE)
            {
              error = FM_ERROR;
              LOG_INFO_APP("OTA_RAW_DATA_ID: FM_WriteStatus != FM_OPERATION_COMPLETE => FM_ERROR\n");
            }
          }
          else if(error == FM_BUSY)
          {
            /* Wait for Write callback to be invoked */
            UTIL_SEQ_WaitEvt ( 1 << CFG_EVENT_FM_WRITE_CALLBACK_EVT_RSP_ID);
            
            /* Clear events before start testing */
            UTIL_SEQ_ClrEvt ( 1 << CFG_EVENT_FM_WRITE_CALLBACK_EVT_RSP_ID);
          }
          else
          {
            LOG_INFO_APP("OTA_RAW_DATA_ID: FM_ERROR\n");
          }
        } /* while(error != FM_OK) */

        /* Update write offset address for the next FLASH write */
        address_offset += size_left;
      }
      /* USER CODE END Service2Char3_WRITE_NO_RESP_EVT */
      break;

    default:
      /* USER CODE BEGIN Service2_Notification_default */

